#ifndef GLOBALDATA
#define GLOBALDATA

#include <QObject>
#include <QDateTime>
#include <QtSql>
#include <QDebug>
#include <QString>

/*=============================================================
 Данный заголовочный файл содержит  набор  пространств  имен, в
 состав которых входят функции, часто  использующиеся в  разных
 модулях программы
=============================================================*/

/*=============================================================
 Пространство имен errors содержит поля и методы, предназначен-
 ные для обработки ошибок
=============================================================*/
namespace errors
{
    //перечислитель, содержащий коды ошибок
    enum errors_e
    {
        EXISTS_TABLE,       //отсутствие таблицы в БД
        DB_ERROR,           //ошибка БД
        EXISTS_RELATION,    //отсутствие отношения между таблицами
        QUERY_ERROR,        //ошибка выполнения запроса
        EMPTY_QUERY_RESULT  //запрос к БД не дал результатов
    };

    extern  QString getCurrentDate  ();                                             //функция возвращает значение текущей даты и времени
    extern  void    printError      (const errors_e code, const QString & value);   //отображение сообщения об ошибке в зависимости от ее кода
}

/*=============================================================
 Пространство имен databases содержит методы по работе с БД
=============================================================*/
namespace databases
{
    extern  bool        connectToDB     (QSqlDatabase &database, QString name = "");            //функция, возвращающая результат подключения к БД
    extern  bool        checkTable      (const QString & tableName, const QString & dbName);    //функция, проверяющая наличие таблицы в БД
    extern  QStringList getTables       (const QString & dbName);                               //функция, получающая перечень таблиц, входящих в состав БД
}

/*=============================================================
 Пространство имен SQL содержит методы, упрощающие генерацию
 SQL-запросов
=============================================================*/
namespace SQL
{
    extern  QString convertToSQLString  (const QVariant & value);   //конвертирование value в строковый формат
}

#endif // GLOBALDATA

